const wordList=[
"屄","屌","阴穴","偷拍","巨骚","裹本","菊花蕾","幼女","风骚淫荡","人民广场","轮奸内射","插你","杂种","台湾岛国","张志清","孙逸仙","江戏子","中华民国","刘延东","奇淫宝鉴","情色","轮奸","玉蒲团","阴道图片","自治机关","分裂祖国","拔屄","暴干","摇头丸","骚浪美女","色色","浪妇","阴蒂","妈批","fuck","干你","扒穴","男女交欢","门安天","系统讯息","奸淫","山口组","总书记","计生委","无码体验","我妳老爸","幼逼","艳情小说","操你妈","乳尻","你妈","蒙尘药","血逼","军用品","屁眼","日本熟母","瘸腿帮","胡主席","高校暴乱","集中营","龟公","大东亚共荣","东突组织","法功","性感肉丝","宾馆女郎","淫妇","煞笔","卖比","强硬发言","菊花洞","淫货","刘云山","王乐泉","中出","塞你母","近亲相奸","婊子","自民党","钓鱼岛","卖号","打倒","耻辱轮奸","你娘","草你","迷奸药","肉穴","玩逼","默克尔","群交","车仑","艾司唑仑","我就色","你姥姥","台湾国","相奸","嫩缝","独立台湾会","品香堂","国家主席","秘裂","爱液","鸡吧","破鞋","劳动保障部","曾培炎","聂荣臻","推油","教育部","刘淇","社科院","他马的","性高潮","骚逼","口交","狗屎","猪容基","贱人","贝肉","人民报","菜逼","红灯区","淫河","中南海斗争","吗啡","共匪","紧穴","媚药少年","催情药","吸精少女","王太华","你大爷","妈逼","去你妈的","胡景涛","专制","窃听器","政协","无界浏览器","恐怖主义","装b","俞正声","民运","奶子","民主","张立昌","蜜洞","艳照","性吧","共产主义","文殊","装逼","强暴","迷幻药","摸阴蒂","老虎机","失意药","大波波","轮操","妳娘的","毛主席","淫店","日你妈","平反","暴淫","联易互动","叫春","小平","灭共","性饥渴","驶你公","穴图","血比","法轮","老逼","激情潮喷","奸情","性之站","法轮大法","出售此号","双臀","中国复兴党","肉缝","共和","塞白","色区","刘明康","刚比","虐奴","清晰内射","大东亚","吴定富","台海局势","妓女","淫水爱液","陈s扁","野外性交","韩正","蒙古独","自焚","下流地带","风尘劫","淫乱电影","口爆吞精","淫贱","腐败","官商勾结","南蛮","你全家","猪毛","艳乳","性感妖娆","骚洞","白嫩骚妇","无帮国","办证","暴力虐待","颜射自拍","我日","呆卵","无码彩图","侦探设备","东京热","瘟疫爆发","屄毛","成人小说","戴海静","肉棒","轮暴","证生成器","性虐待","胡乔木","淫水横溢","高清性爱","狂操","美体艳姿","仆街","乳交","叫小姐","阴毛","浪叫","人代会","人体炸弹","干砲","禽兽","下注","阳具","斧头镰刀","原味丝袜","巨奶","裸露","欲火","军长发威","淫荡","麻醉钢枪","乔石","温比","妩媚挑逗","无套内射","做爱","南蛮子","删除负面信息","盗窃犯","卖卡","国民政府","钓鱼岛","警奴","色欲","张朝阳","制服狩","靠腰","阴门","镇压","开苞","吹箫","乱交","狼友","连続失禁","陈总统","吃精","小日本","农业部","唑仑","身份证","性交吞精","淫告白","温总理","卵子","淫浪","抢劫","毛泽东","车仑","极品","体奸","嫖客","火辣图片","肉蒲团","陈希同","梅花屄","法仑","肉具","撒切尔","煞逼","扒屄","日你","黄色电影","你姥姥的","好色","法愣","赖达","蝴蝶逼","肉便器","援藏","干逼","性欲","人代","华建敏","朱熔基","爆操","换妻","静坐","射爽","钱其琛","李长春","杀警","欲女","淫肉诱惑","催情","李登辉","东亚病夫","外专局","洗脑班","境外媒体","枪决女犯","操逼","恐怖份子","乳霸","淫色贴图","孙文","烂游戏","援交","黑社会","比毛","革命","回良玉","新疆分裂","驶你娘","共党","干拎娘","淫乱","weng安","蒋中正","自sha","群发器","美国佬","幼妓","负面信息处理","嫩屄","商务部","喷精","失身","我日你","丝袜淫妇","大麻树脂","里鹏","圣泉学淫","子宫","找个爸爸","亚情","李铁映","成人片","近亲相奸","淫色","强奸","嫖娼","董文华","作爱","淫乱潮吹","迷奸","给你爽","奶挺臀翘","粉屄","她妈","东亚","藓鲍","肛屄","陈至立","王宝森","侨办","示威","大胆少女","性交图","肉唇","射奶","调教虐待","滥货","骚货","妳马的","转法轮","3p","去你妈","厕奴","我操","找个妈妈","婚外恋","动乱","吃屎","镇压","亚历山大","舔鸡巴","支那","王刚","学潮","荡妇","吴官正","龟头","发论","春光外泻","自杀指南","李岚清","性奴","洗钱","车仑","淫娃","林彪","巧淫奸戏","嫩鲍鱼","胡志明","梅毒","瘸腿帮","牛头马面","淫奸","李克强","艳遇","枪子弹","本拉登","靠北","淫水","傻逼","淫虐","上访","轮功","优化官员","高潮集锦","鸡鸡","法制办","高校群体事件","嫖妓","神汉","颜骑","贱货","群体事件","色诱","吗的","邓小平","无界浏览","生奸内射","成人色情","放荡","小乳头","群阴会","多人性爱","激情图片","麦角酸","强制浣肠","阿扁","国民党万岁","电监会","中华民国","内衣","飞凤春宵","援交妹","舔屄","操妳","熟母","你妈逼","淫女","应召女郎","贱种","赵紫阳","流淫","偷窥图片","东条英机","屌西","徐向前","淫蜜","档案局","无码精选","朱容鸡","性感诱惑","陈云","喷你","发伦","偷窥","成人文学","丝诱","搞她","艳舞淫业","龟儿子","屌鸠","高潮白浆","浪穴","淫痴","姣西","干的爽","内裤","嫐屄","黄色小说","紫阳","新疆独立","操你","鸡奸","他爹","皇冠","阴核","阳痿","风艳阁","专政","咪咪","黄色小电影","神经病","g片","骚妇","无套自拍","酥穴","小逼","淫浆","她妈的","曲线消魂","淫乱诊所","维吾","高丽棒子","山本","虐待","尼克松","塞你爸","薄熙","张磊","奶头","浪漫邂逅","色子","夜情","税务总局","亮穴","炸药","李录","卖淫","苹果日报","姫辱","朱容基","淫样","学潮","共党","发情","机巴","美逼","翘臀嫩逼","新疆独","烂逼","你爷","张伟国","熟女","推翻","家元自称玉皇大帝","食屎","美骚妇","李小琳","王刚","经典炮图","阴蒂","针孔偷拍","政治犯","公安部","春药","狗卵","幼齿","熟妇","肥逼","18禁","激情聊天","新义安","干死你","狗屁","水利部","阴水","伊扎布特","李洪志","紧缚凌辱","私家侦探","戳你","风骚欲女","阴阜","硝酸甘油","人权","小穴","干死","押大","艳舞","天安门","海luo因","少女被插","洗脑","淫汁","插逼","黄色网站","田纪云","做爱","浪女","出售雷管","玉穴","黄片","贪污","蔡赴朝","私处","插阴","王兆国","拐卖","分裂","露阴照","骚卵","冈峦","颜射","淫水丝袜","焦国标","色情电影","肉棍","安非他命","买春堂","游行","投毒杀人","迷药","江贼民","售氯胺","天天情色","暴奸","鸡巴","党章","鸡巴","手淫","母子交欢","父母下岗儿下地","艳帝","叫床","道县公安","外挂","风骚","军国主义","粮食局","放尿","臭化西","阴茎","迟浩田","脱内裤","自杀手册","打倒","胡锦涛","穆罕默德","龙新民","大便","太阳城","亲美","骚浪","骚妇露逼","烂逼","淫水","滚那吗","女干","黑手党","操烂","靠爸","淫魔","国管局","魅惑巨乳","操死","梅花网","滥逼","肉壶","骚水","妳妈的","傻比","流血冲突","酥胸","高潮","驶你爸","严方军","中俄边界新约","淫荡","车臣","国产偷拍","互淫","夜情","藏青会","耶苏","好嫩","男女蒲典","草的你妈","精液榨取","少妇","美乳斗艳","鸡芭","阳精","幸运抽奖","台湾民国","李先念","轮盘赌","打飞机","兽欲","日本有码","亚洲淫娃","王乐泉","胡乔木","胡锦涛","牛逼","阴囊","乳晕","阴屄","王岐山","台湾建国","何候华","少修正","肉壁","淫毛","狂插","4事件","朱镕基","警匪","老味","妈b","肉感炮友","淫语连连","性无能","欲仙欲死","乳沟","生殖器","替考","处女","拍肩神药","左翼联盟","洪志","无码","明慧","塔利班","破处","西洋美女","龟孙子","美少妇","奸杀","带套肛交","可待因","淫穴","套牌","被插","反社会","诱惑视频","基地组织","空难","罢运","人民代表","美女走光","台湾帝国","护士诱惑","湿身诱惑","屠杀","小电影","叶剑英","屌妳","嗑药","做爱图","卖软件","肏你","偷欢","台独","激情裸聊","私处","发伦功","大乳","直销","刘伯承","日本骚货","肉茎","母奸","大史记","骚屄","就去诱惑","喷精","放荡","毒品","汉奸","强奸处女","吃大便","性虎","真善忍","亚洲性虐","阴茎","逼痒","王丹","胡紧套","吸精","王兆国","羞耻母","卖淫","黑屄","民进党","熟女颜射","阴道","超毛大鲍","战牌","张钢","屌7","嫩逼","毛派","子弹","学运","盗撮","反共","插入内射","寇晓伟","拔屄自拍","采花堂","彩票","掰穴","性虐","他祖宗","摇头丸","玉杵","淫媚","虎骑","受虐狂","台湾独立","淫妻","日你爷爷","乳爆","刚比样子","肉沟","淫乱","胡紧掏","淫女炮图","丁关根","抽插","鸡掰","爆乳娘","杀人","江青","肉逼","江理论","共产党","淋病","偷情","妈比","露屄","狗日的","王秀丽","激情小电影","反革命","梦幻西游","郭伯雄","淫兽","东亚共荣","共狗","押小","乱伦","王胜俊","塞你老师","阴水","姘头","幼图","巨炮兵团","日他","骚女叫春","馒头屄","伊力哈木","傻子","乳此丰满","谢非","强卫","操肿","口射","删号","阴户","民运","大乱交","王洪文","法轮功","赌马","自拍写真","逼毛","交配","乱交","李鸿忠","枪支弹药","张高丽","美女高潮","张潮阳","江戏子","吹箫","胡x","曼德拉","合彩","淫货","弓单","娘的","锦涛","陈独秀","淫情","肛交","外挂","性交","胡锦淘","嫖妓指南","贾庆林","鞑子","骚妻","纪登奎","鸠屎","淫妹","华盛顿","品色堂","巨屌","伊斯兰","温云松","肛门拳交","假钞","大卫教","民泽江","发抡","宋庆龄","夫妻成长日记","阳物","耿飚","周恩来","裸陪","淫水涟涟","77式","乳射","子女任职名单","饿比","淫逼","吸毒","发国难财","江泽民","台湾帝国","民政部","情色天崖","垃圾游戏","流氓","国贼","丁香社区","无码","欧美大乳","明慧网","淫妇自慰","安拉","素人娘","迷香","滥比","藏独","包养","张丹红","日你妈","炮友","拳交","宋任穷","张德江","疆独","荡女","烂屄","阴精","骚姨妈","妖媚熟母","插妳","发骚","假币","暴力","删帖","要色色","阴部","江折民","露逼","隐窝窝","叫鸡","应召","耀邦","发轮","暴政","嫩奶","王从吾","那吗逼","警匪","青天白日","神婆","真理教","干她","淫母","是鸡","台湾共和国","自杀","女尻","监禁陵辱","穴爽","骚浪","额尔德尼","撒尿","爆炸物","圣女峰","色影院","产权局","装屄","口内爆射","双龙入洞","美腿丝足","奸夫淫妇","乳头","性福","政变","盘古乐队","淫丝荡袜","赌博","淫妞","人民报","阴茎","氵去","gong和","藏春阁","跳大神","插你妈","shit","张廷发","俪影蝎心","乔石","代开","盗窃犯","钓鱼台","江氏","朱总理","干你娘","老共","淫术炼金士","亲民党","蒙古独立","晚年周恩来","全裸","发正念","玉乳","错比","吕祖善","有华龙","妈了个逼","官逼民反","猖妓","日你娘","插她","张筱雨","李禄","品穴","蒙独","有容奶大","达赖","杨勇","伊斯兰","草拟妈","刘志军","裸女","屠杀","下贱","浴尿","杂种","中国政府","包皮","骚女","十年动乱","保钓","屌毛","第6代领导","成人论坛","李鹏","硬挺","钱达","舔逼","曹刚川","柴玲","法仑","姜春云","无码淫女","被操","神经病","江贼","国军","淫图","震死他们","操蛋","黄片","爱国运动正名","荡妇","赵海青","暴动","抠穴","兽交","食捻屎","淫兽学园","玉女心经","周永康","洗肠射尿","公头","阳物","中共中央","丙酮","肏屄","打野炮","下流","色迷城","尉健行","密洞","穆斯林","国民党","谋杀","靠你妈","人体摄影","毒龙舔脚","妈比","黄兴国","公产党","甲基苯丙胺","高治联","丰唇艳姬","台湾建国","柔阴术","日死","朱德","现金交易","追查国际","胡总","操穴","妳娘","操射","屄屄特写","特共","江主席","草你妈","08宪","丫的","靖国神社","乙醚","日屄","羟亚胺","吗逼","兽交","炸药配方","蒙独","精液浴","口淫","台湾党","惹火身材","实际神","5毛党","发抡功","xing伴侣","人民大会堂","那吗瘟比","迷情","嫩穴","聂树斌","逼奸","无码丝袜","吗比","反政府","食精","舔屁眼","周总理","死逼","下贱","温加宝","辛灏年","月经","王昊","高级逼","黄菊","淫欲日本","贱人","性感乳娘","胡紧涛","核武器","打飞机","江猪","激插","你老味","潮吹","毛太祖","美女吞精","堕淫","组装手枪","全范围教会","la萨","隐形喷剂","陈良宇","党主席","寻找林昭的灵魂","新疆国","兴奋剂","中国民主党","淫欲","爆乳","集体淫","政付","内射","上你","少妇白洁","法轮","干炮","曾荫权","坐台","华国锋","大奶骚女","操妻","属灵教","全国两会","售号","发正念","淫驴屯","两国论","郭罗基","杨思敏","筹码","性佣","扎卡维","大奶美逼","吴邦国","暴徒","大法","穴淫","李宏志","斗地主","宋平","露点","圣战","蒋彦永","周恩来","买卖枪支","淫腔","骚母","骚穴","纳粹","台独","浴室自拍","美国之音","g点","淫声浪语","习近平","郭岩华","东热空姐","奸你","屁股","明星淫图","他娘","口爆","弹劾","淫乱工作","法囵","密宗","欠干","郁慕明","江择民","轮奸","刷票","股市民谣","罢工","宇明网","干穴","干死你","援助交易","他吗的","诸世纪","爱滋","女马","你姥","傻卵","威而钢","司法部","烂屌","叼你","廉政大论坛","胡jt","独裁","达赖喇嘛","温家宝","插阴茎","兽奸","国产嫖娼","摸你","提前预测","a扁","插b","刘晓竹","乖乖粉","先奸后杀","南京军区","前凸后翘","倭国","胡紧掏","中共","荡妹","李小鹏","射精","东突","艳照","默罕默德","生徒胸触","欲火焚身","军用","博讯","氯胺酮","极品波神","全家不得好死","法0功","日本鬼子","私服","美穴","卖党求荣","女屄","激情小说","莫索里尼","操你娘","万税","女干","狗操","白莲教","肉欲","温加饱","他妈的","狗日","安眠药","生鸦片","迫奸","激情电影","中国论坛","性生活","无官正","5月35","童颜巨乳","赌球","口活","sb","珐轮功","朱溶剂","两个中国","发浪","插深些","含屌","乳波臀浪","迷魂药","淫靡","萨马兰奇","清zhen","你色吗","放下生死","成人网站","金鳞岂是池中物","法轮大法","贺国强","猥亵","系统公告","造反","吴仪","你妈的","骚乳","江独裁","阳具","假身份证","东方闪电","国共合作","k粉","打炮","性趣","李瑞环","天主教","大波骚妇","抽你丫的","激凸走光","羟丁酸","老毛子","择民","迷情水","笨逼","暴乱","刘少奇","中国猪","爽死我了","台独分子","嫩鲍","阎明复","现代逍遥录","淫书","华国锋","太子党","两个中国","性骚扰","董建华","赵洪祝","红满堂","地藏","宾周","淫流","插我","杀人犯","中央军委","皮条","外挂","中年美妇","明慧","卧艹","爆草","温元凯","日他娘","抽头","猛插","网特","高校骚乱","咬着龟头","开苞","定位器","售软件","销魂洞","小比样","皇军","庆红","曰你","足脚交","街头对抗","淫水横流","法轮功","干部","国安局","豪乳","就去日","双规","麻醉乙醚","尼古丁","上妳","阳萎","藏民","性交课","大力抽送","核潜艇","快感","高薪养廉","你妈比","吴仪","迫害","主神教","发论工","卖逼","国防部","大参考","滥交","对日强硬","爽穴","谢长廷","炸yao","高自联","吗啡碱","大麻油","傻吊","成人电影","干的你","迷幻","雪山狮子旗","亚洲情色","逼样","政治局常委","大奶头","那吗错比","制服美妇","bbc中文网","傅锐","套牌车","伪火","爱幼阁","万淫堂","奴畜抄","阴毛","罢饭","自由时报","集体自杀","中特","骑你","辛灏年","要射了","火药原理","银民吧","奸淫","机叭","起义","性福联盟","发论功","藏人","淫贱","小电影","阎王","日本素人","巨乳","强奸犯","新华内情","发论功","两腿之间","绵阳","恶党","裙内偷拍","妈的","温逼","回回","笨屄","罗干","激情打炮","抡功","江贼民","动乱","何祚庥","文革","林文漪","希望之声","蒙汗药","肛门","买春","氢弹","国家民委","丝袜足交","皮条客","国家机密","大胆出位","东洋屄","无码无套","希特勒","性无能","新型毒品","做爱自拍","淫情贴图","售假币","淫姐","起爆器","丁子霖","插你妈","代血浆","操你全家","袁纯清","sm女王","草你妈","贱比","蒋中正","猫贼洞","胸涛乳浪","奥晕","办理证件","奶头","这不是天灾","玩穴","操黑","法轮","真主","轮奸","新闻管制","电狗","蠢猪","大卫教","花花公子","桃园蜜洞","王震","陈水扁","大法弟子","保密局","幼交","子宫","车仑工力","戒急用忍","沃尔开西","8的平方事件","吴方城","欠日","飘飘","鲜族","潮喷无码","做爱","专供","国家领导人","劳拉","砝仑","薄码","中华人民实话实说","淫棍","田纪云","打倒共产党","你妈","色猫","挫仑","姚文元","班禅","阴缔","阴部","枪模","裙下风光","脚交","白粉","曾庆红","经血","窝窝客","裸露自拍","套弄","走光偷拍","民进党","监狱","郭金龙","韩国狗","告中国人民解放军广大官兵书","主席画像","新生网","卖逼","淫秽","全家死光","性息","胡耀邦","主席李世民","奸幼","密穴","法克鱿","天阉","则民","隐私图片","吴宏达","南京大学法学院","女优","贱比","薄熙来","爱神之传奇","肉箫","天皇陛下","女也","黑逼","6合彩","赤裸","蒙汗药粉","平小邓","肉丝裤袜","坐庄","烂货","初夜","操屄","骚棍","母子奸情","拔出来","招妓","湿穴","全家死绝","联名上书","刘奇葆","翁安","同性恋","老习","老比","di制","电信路","探测狗","坐台的","煞笔","色狼","干他","火辣","短信群发器","封锁消息","淫电影","胡惊涛","处男","汶川","母女双飞","电车之狼","朱骏","贱逼","江泽民","少年阿宾","贡挡","肉洞","出现暴动","去中央","64时期","杀手","供产","9ping","曾宪梓","粉穴","操爽","插你爷爷","茎候佳阴","去你妈的","孙家正","膏药旗","塞你娘","活佛","大血比","中国当局","特贡","吃鸡巴","处女","朱云来","粗制吗啡","暴乳","法lun功","傻屄","干你娘","门徒会","肉棍子","卖国求荣","炸弹制作","你奶","中共","臭作","党鞭","蒋介石","蒙古鞑子","激情在线","网特","阴精","王汉斌","示wei","专制","令计划","吗啡","辅助程序","肾源","支联会","兽兽","小便","开房","亲共","植物冰","流蜜汁","东突解放组织","想上你","骚妈","出售神符","干比","彭真","你妈逼","杨洁篪","地下教会","熟女护士","震惊全球","地震来得更猛烈","圣战","插穴","操我","血洗京城","老江","我干","禁书","鸡毛信文汇","大东亚共荣","婬乱军团","干你","瘟比","苯丙胺","出售发票","王振华","叼你妈","骚逼","麻黄碱","性奴会","死全家","杀你全家","习仲勋","淫の方程式","江罗","国家安全","朱狨基","东正教","万人大签名","葬独","日逼","蒙古达子","腐败中国","能力主","男公关","日本帝国","步qiang","邪恶的党","胡锦滔","功法","中日没有不友好的","干你妈","法西斯","欧美无套","温家堡","猥亵","罢吃","淫叫","熟妇骚器","金枪不倒","几吧","专制政权","魏京生","穷逼","发伦功","成都军区","中国的陷阱","被干","淫液","办理文凭","淫虫","专政","警察殴打","混蛋","丁丙诺啡","中共","私服","他母亲","爱他死","余震","售健卫","套现","南蛮子","谁是新中国","由喜贵","淫糜","戴相龙","热比娅","群奸乱交","酥痒","屄屄","李德生","锋同志","皇家轮盘","知道64","安非他明","插暴","吴百益","去死","豆腐渣","激情网站","当官靠后台","方毅","淫教师","砝伦","吞精","浮夸风","穴口","贱货","淫乱熟女","极品波霸","赵紫阳","江某某","赵海青","西葬","我靠","王冶坪","多人轮","渣波波","性战擂台","王东明","总书记","夫妇乐园","人兽","曾道人","独夫","狗杂种","萨斯","干全家","肉缝","骚货","中共","迫害","中国共产党","独立中文笔会","cao你","夏川纯","法x功","国家主席","杨得志","孙中山","于幼军","江派","拱铲","射颜","李月月鸟","第7代领导","你妈靠","卖财富","讨回工资","沈跃跃","集会","摸胸","强制拆除","造爱","bao炸","他妈","天鹅之旅","外挂","释欲","氟硝西泮","松花江污染","售麻醉","东条英机","政zhi","倭寇","贺卫方","嫩女","无耻","黑手党","露毛","小嫩鸡","恩氟烷","jing坐","真主安拉","fl功","皮条","奴隷调教","彭丽媛","正法","中共","学百度潮","发论公","骚比","吉跋猫","骚鸡","中共","弓弩论坛","鸟你","两岸关系","国产无码","骚包","张定发","摸奶","杀人犯","淫威","中国官场情杀案","赔率","操b","草妈","联邦政府","赌博机","温x","满狗","性爱图片","江沢民","孟建柱","赫鲁晓夫","负面信息","症腐","政治打击","针孔摄象","徐才厚","朱镕鸡","出售炸药","政府无能","国产骚货","中国政治新星","林炎志","大东亚","龟投","学生暴动","中共当局","无码炮图","入联","大纪元","幼男","苯基丙酮","叔嫂肉欲","钦本立","舔脚","共荣圈","64动乱","政治局","次下跪","麦当劳被砸","迷奸粉","傻b","西脏","奶罩","法伦","英国金融时报","中央电视台","占领台湾","代开发票","找小姐","处女膜","炸药","手机监","寂寞男","中华帝国","邓质方","开锁工具","吹萧","无网界","军转","淫网","供铲党","藏字石","写真","骚姐姐","万人骚动","蒋公纪念歌","烂比","官匪","彭德怀","组织集体","杜世成","64惨案","援助交际","妈逼","钱国梁","促红细胞生成素","日军","jq的来","杨汝岱","你爷","燃烧剂","汕尾事件","新生网","人皮","中华时事","例假","淫虫","贺子珍","吴德","中国威胁论","释迦牟尼","杀死","党的喉舌","汪兆钧","艹你","戒严","酣乐欣","妓院","毛zx","共军","社会主义灭亡","瘟家","十7大","世维会","正清网","动乱","毛泽东","罗箭","售肾","张林","李愚蠢","龟儿子","中国复兴论坛","民运","圣火","梁光烈","金瓶梅","自由民主论坛","共残主义","校鸡","反雷达测速","px项目","援交自拍","迷昏药","日本万岁","草泥马","猎艳","促性腺激素","卖国","吗的","逼样","国际特赦","发生暴动","麻古","法论","湾台","皇军","你办事我放心","冰砖","胡温","政f","中共","暴政","韦国清","温宝宝","荡妹","台毒","胡的接班人","阿波罗网","中华人民正邪","假证件","流氓","民运","高干子弟","丙腈","干比","百家乐","穆罕穆德","中国新民党","插比","中南海秘闻","雷管","国研","干部","打砸抢","火药制作","军妓","军队","化工厂爆炸","侯德健","美女视频","卖发票","售军用","邓颖超","血书","大sb","台军","沈彤","胡boss","中华大众","中国当局","床上功夫","维多利亚公园","杨树宽","常万全","闹独立","退党","国姆","阿旺晋美","发纶","山西黑砖窑","宪法法院","发改委","达赖喇嘛","下体","国峰","新诗年鉴","诱奸","淫女老师","麻黄草","印尼事件","爱滋病","脱党","强开工具","大史纪","黄华华","吾尔","群体性事件","艳史","死刑过程","民运","卖肾","木牛流马的污染比汽车飞机大","报禁","xiao平","手机监听","李屠夫","粗口歌","红外透视","扌由插","列确","娼妓","霸工","代写论文","封面女郎","人肉","达赖","周小川","爆菊","老汉推车","钦定接班人","中纪委","鸽派","法正","金麟岂是池中物","规模冲突","喝血社会","卖骚","7大军区","藏暴乱","西奘","中共","调情","龟公","中珙","淫荡口交","网评员","中共","yin荡","手机卡复制器","中华联邦","普贤","傻鸟","平近习","镇压学生","苍蝇水","王洛林","强jian","天安门事件","李学举","戒yan","春夏之交","法抡","广州军区","共独","fa轮","济南军区","严家其","警民冲突","反右题材","血洗","钟山风雨论坛","黑客","胡海清","激情热舞","第4代领导","王瑞林","婊子养的","黄冰","袭警","信访","迷魂药","共x党","手机复制","催泪弹","杜冷丁","草你吗","致幻剂","寂寞女","曲马多","独裁","法网恢恢","共惨","汤加丽","精神药品","杨佳","弓弩销售","厦门大游行","g产","军刀专卖","针孔摄像机","温jb","中俄密约","台海大战","证监会","扶不起的阿斗","龙小霞","肏死","体位","高智晟","公开信","娘饿比","陪睡","告全国同胞书","假证","唐人电视台","特殊服务","东方微点","刘永清","中国政坛新星","中国泛蓝联盟","机掰","自由亚州","628事件","异议人士","漏乳","抓胸","栗智","黄牙签","草拟妈","痛批政法委","骚棒","法抡功","搞死","大纪元","正悟网","方励之","刹笔","中华真实报道","法lun","我草","产党共","售虎头","死亡笔记","甲基安非他命","法轮佛法","ze民","亲日","谷牧","按照马雅历法","信用卡提现","回民暴动","靖志远","代孕","器官","机吧","孔丹","正府","操你祖宗","何勇","国之母","淫亵","帝国之梦","杨元元","爆zha","刷信誉","高干子女","菊门","张伯笠","房事","罢餐","梁保华","借腹生子","突破封锁","共产党的报应","中共","张昭富","军区","廖承志","下作","法抡","调查婚外情","干死","睡着的武神","周正毅","舔阴","焚烧中国国旗","政府软弱","沧澜曲","共产主义的幽灵","活体","器官","公安把秩序搞乱","饭菜涨价","氵去车仑","狗养","中办发","18大","民运","89年春夏之交","皮箱炸弹","法论功","推翻社会主义制度","你麻痹","退dang","性爱电影","入耳关","麦司卡林","李源潮","催情液","罢食","人民代表大会","9风","地西泮","兰州军区","稀藏","美国凯德","砝轮","中国高层人事变动解读","芬太尼","耽美","麻果","美国广播公司","黎阳平","廖锡龙","天府广场","藏青会","你吗b","枪手","共产王朝","下身","江湖淫娘","家l福","透视眼镜","许其亮","王维林","同胞书","周天法","苏东解体","针刺","政治风波","假发票","韩正","万人暴","寂寞少妇","北京政权","同性恋","红楼遗秘","绕过封锁","燃烧弹","瘟家","干扰器","ba课","导爆索","dl喇嘛","绝食抗暴","互联网审查","民运人士","苏振华","高利贷","邹家华","徐和柴学友","瓮安事件","中俄边界","山西洪洞","汪东兴","社会黑暗","短信群发","家le福","爱国者同盟","脱裤门","东森电视","共铲党","星岛日报","刘瑞龙","为了忘却的纪念","亡党亡国","胡春华","切腹","赵铁锤","正邪大决战","胡启立","警官证","秦基伟","阴核","吸精痴女","徐绍史","招鸡","天灭中共","电警棒","红楼绮梦","希葬","64事件","色女","聊性","推bei图","动乱","肥东交警","中共黑","北京帮","肏穴","军品","台湾独立","周刊纪事","邓榕","狂风暴雨","引起暴动","强制捐款","赵晓微","zha弹","政治避难","政俯","售防身","罢考","胸推","松岛枫","万里大造林","黑火药","中华局域网","李锡铭","淫间道","喂奶门","江泽慧","军事社","证件办理","解放tw","第21集团军","脱衣舞","李继耐","戴秉国","苏树林","手拍肩","亡党","推背图","邓派","诺查丹玛斯","媚外","9学","独夫民贼","发沦","解决台湾","温jia宝","卖骚","凸点装","性启蒙","异氰酸甲酯","北京军区","用刀横向切腹","收复台湾","张小洋","完全自杀手册","仓井空","z东","周锋锁","世界日报","莫达非尼","团中央","沈阳军区","城管暴力执法","da选","当局严密封锁","赌场","高勤荣","屠光绍","89学潮","硒藏","雷管出售","网络评论员","共产党","偷情网","他娘的","惨奥","宪政","监听王","践踏中国女性","迷失少女天堂","维汉","台湾问题","陈锡联","共军","于永波","灭绝罪","王千源","马恺","中gong","包娃衣","zf大楼","改革历程","陈建国","懊孕","解放台湾","民运","泽d","zi杀","北京当局","周容重","反中游行","海乐神","影片","20和谐年","倪志福","无网界浏览","砲友","搞你","妈比","讨说法","这年头就这样","塑胶炸弹","东京热","屠城","言论自由","麻痹","杜德印","法新闻社","济世灵文","谭作人","军区","a片","简易炸药","讨伐中宣部","中华讲清","胡海峰","邓朴方","台海战争","阴门","白宫事件","办文凭","淫洞","元极功","鹰派","佳静安定片","胡平","zang人","洪发交流","攻占台湾","地震预测","打针","刘华清","我的性启蒙老师","胡新宇","李树菲","假钱","黄色文学","红色贵族","乳峰","色盟","草你丫","进攻台湾","华盛顿邮报","下体","霸餐","法谪","禽兽","贱b","军民冲突","巨额骗储","它妈","根达亚文明","色妹妹","骚b","尾行","党禁","供铲裆","支持台湾","法lg","发囵","舆论反制","中国高层权力斗争","刘刚","奥孕","甲基安非他明","贯通两极法","朱颜血","挡中央","中国人权","中国社会的艾滋病","光复民国","档中央","学chao","h动画","张开双腿","武侯祠","流氓","政府","菊穴","中功","蒙古分裂分子","江浙民","石肖","阴茎","风骚侍女","鸡鸡","嫖鸡","工商税务两条狼","激情午夜","中国改革年代政治斗争","退团","屠杀","封从德","阴毛","小穴","你全家","台海问题","短信猫","包过","安纳咖","雷汞","法纶","乌兰夫","共铲","蒋捷连","周生贤","官人我要","国母","滥交","珐伦","红色恐怖","阴囊","简易炸弹","独裁政治","台弯","王沪宁","性器","卖身","大揭露","骑士","右派","司马璐","75事件","邱会作","恐怖分子","基督灵恩布道团","打台湾","法车仑","弓弩制作","中国人民解放军","江蛤蟆","川b26931","清华帮","安魂网","日本帝国","售弹簧刀","你祖宗","别梦成灰","ze东","透视扑","选国家主席","两岸战争","希藏","请命","往事追忆录","点对点裸聊","圣战组织","美女视频聊天","淫窝窝","文化大革命","网络封锁","yang佳","共残裆","政腐","兽性","南街村","上海帮","毒豺","发缥","血洒","舔b","胡温","政府","共产专制","张万年","新闻封锁","烯丙胺","神的教会","制服诱惑","代理发票","黄丽满","十景缎","圆明网","赵品潞","中共黑帮","拉凳","售单管","中国教徒","崔英杰","陈德铭","法十轮十功","弓弩专营","中石化说亏损","美联社","做人不能太cctv了","舌战法庭","屠城","万润南","你娘的","代生孩子","退党","成人游戏","淫兽学","自由写作奖","硝酸汞","张培莉","温加保","后勤集团","gong党","jie严","胡锦涛","巴特尔","坐脸","裸照","张志国","真他妈","西z","党产共","露b","台海危机","隐瞒地震","河蟹社会","黑天使","狗逼","8341部队","狗草","微型摄像","谭绍文","暗杀","中国社会进步党","女神教","赵晓微","李沛瑶","中国海外腐败兵团","大赦国际","zha药","套弄鸡巴","江绵康","珐仑","裙中性运动","持不同政见","王克","超越红墙","淫书","燃烧瓶","裸聊合法","欧美图区","野鸡","原味内衣","文字狱","火乍","福音会","轮子功","藏西","新唐人","周建南","陈绍基","亢议","我色","台百度湾","失忆药","公检法是流氓","纽约时报","杨尚昆","江胡","王学军","浪逼","硝化甘油","军区","民运","江哥","炸弹配方","别他吗","台wan","猫泽东","江浙闽","震其国土","余秋里","刷淘宝","温元凯","罢教","贞操","尹方明","不要沉默","杀b","印尼屠华","日军","神泣","追踪器","殃视","乖乖水","少儿不宜","弓弩直销","娇艳人生","灭亡中国","静zuo","何清涟","新疆骚乱","64运动","逃亡艳旅","吾尔开希","黄色漫画","姚依林","祁培文","哒赖","血恋","胡派","罢ke","台du","第2代领导","猫则东","马勒","法o功","核弹","黑窑奴役","政百度府","汉维","仇共","禁播","中国真实内容","昝爱宗","淫奸","陈相贵","去氧麻黄碱","新金瓶梅","中国民主党联合总部","林树森","罢课","王炳章","办假证","中国问题论坛","奚国华","亚洲周刊","他们嫌我挡了城市的道路","人肉炸弹","激情视频","毛zd","反party","胡j涛","找政府评理","臧独","龟头","中共","专制","特供","催情粉","中国的人权","没有人权","g匪","坦克压大学生","黑星女侠","藏m","藏du","张志新","炸药出售","共贪党","共产党","出售肾","法沦","台湾猪","反党","第5代领导","江x","基督教科学箴言报","指点江山论坛","工产党","朱嘉明","宋平顺","陈炳德","逢8必灾","处女开苞","罢参","芮杏文","大禁","湖紧掏","致胡书记的公开信","共残党","中共独裁","劣等民族","人quan","独眼","主席像","西独","吾尔开西","政治迫害","中国时报","邓玉娇","土g","雅虎香港","弹药配方","宙最高法","桃色","威胁论","民运","中印边界谈判结果","茳泽民","北京风波","侦听器","老j","可待因","多党执政","人拳","朱瑟里诺","粟戎生","丹增嘉措","淫照","马飚","江绵恒","支持zd","金盾工程","自由亚洲","茎候佳阴","干逼","股民信息","亚洲美女","法会","邪党","观音法门","游xing","火药配方","x民党","黄镇","邓晓平","被立王","欧广源","贺立旗","明慧周报","王超华","历史的伤口","平反","核蛋","共产党的末日","min主","志洪李","截访","日烂","性技巧","迷幻药","罂粟壳","可可精","中央黑幕","国产av","师傅法身","苏贞昌","告全体网民书","中共解体","反奥","上中央","懊运","朱海仑","温如春","华主席","魔域","极景","打倒中国","伪钞","共奴","狗娘养","供铲谠","王奉友","叶群","麻黄素","安钠咖","法谪功","破网","麻痹的","正义党论坛","天按门","轮法功","中国社会论坛","发生关系","傅全有","人类灭亡进程表","炸dan","任弼时","手机跟踪定位器","菊地丽子","摸nai门","胡jintao","抵制日货","许世友","请愿","藏毒","彭冲","国wu院","电击枪","群发软件","男奴","权贵集团","吴胜利","邓xp","操他妈","法论公","反屏蔽","股民资料","迷魂香","夜勤病栋","印尼伊斯兰祈祷团","陈慕华","爆你菊"
]
/*
 * 2024-11-04
 * 敏感词过滤
 * 这里一直有一个问题就是
 * 敏感词检测不完整，就比如对于一个敏感词 AB
 * 存在另外一个敏感词BC，那么检测的时候就会检测到BC，
 * 而不是AB，导致检测结果不完整
 */
class TrieNode {
    constructor() {
        this.children = {}
        this.isEnd = false // 标记是否为敏感词的结束
    }
}
class Trie {
    constructor(wordList) {
        this.root = new TrieNode()
        for (const word of wordList) {
            //遍历单词列表
            let node = this.root
            for (const char of word) {
                //遍历单词字符
                if (!node.children[char]) {
                    //如果当前的字符不在树中，则直接添加
                    node.children[char] = new TrieNode()
                }
                node = node.children[char]
            }
            // 遍历到敏感词的末尾，设置 isEnd 为 true
            node.isEnd = true
        }
    }
}
var trie = new Trie(wordList)
const root = trie.root
var nodeNow = root
var return_word = ''
var count=0
export const detect =(text)=>{//
    nodeNow = root
    for (let ind = 0; ind < text.length; ind++) {
        const char = text[ind]
        if (!nodeNow.children[char]) {
            //如果当前的字符不在树中，继续
            ind-=(count-1)  
            count=0
            nodeNow = root
            return_word = ''
        } else {
            //如果在，更新 node
            nodeNow = nodeNow.children[char]
            count++
            return_word += char
            if (nodeNow.isEnd) {
                //如果已经出现了敏感词
                //尝试继续往后进行遍历
                const re=return_word;
                return_word=''
                return re
            }
        }
    }
    return ''
}
//返回一个布尔值，判断敏感词是否可扩
function if_can_expand (node,text,ind){
    var node_now=node;
    for(;ind<text.length;ind++){
        const char=text[ind];
        if(!node_now.children[char]){//文本的下一个字符不在树中，不可扩
            return false;
        }
        //这里说明文本的下一个字符在树中，判断是否为end
        node_now=node_now.children[char]
        if(node_now.isEnd){//如果是一个敏感词的结尾，返回true
            return true;
        }else{
            continue;
        }
    }
    return false;
}
export const replaceAll=(text)=> {
    var nodeNow = root
    var return_word = ''
    var count = 0;
    var word_set=[];
    for (let ind = 0; ind < text.length; ind++) {
        const char = text[ind]
        if (!nodeNow.children[char]) {
            // 如果当前的字符不在树中，继续
            nodeNow=root;
            return_word=''
            if(count!=0){
                ind-=(count);
                count=0;
            }  
            count=0
        } else {
            // 如果在，更新 node
            nodeNow = nodeNow.children[char]
            count++
            return_word += char
            if (nodeNow.isEnd) {
                // 如果已经出现了敏感词
                //判断敏感词是否可扩展
                if(if_can_expand(nodeNow,text,ind+1)){
                    continue;
                }else{
                    if(!word_set.includes(return_word)){
                        word_set.push(return_word)
                    }
                    nodeNow = root
                    return_word = ''
                }
            }
        }
    }
    return word_set;
}